#define Note ""

/** //by renqihong

ToDo:
1. Read File From Path; OK====> optimize point: when blocks get from FAT table are continuous, can read from disk once, it can reduce, disk io.
2. Fix trigger event with mouse and keyboard; OK
3. NetWork connect baidu.com; ==> driver not found
4. File System Simple Management; ==> current can read and write, Sub directory read,NTFS almost ok.
5. progcess; ==> current mouse move, keyboard input, read file they can similar to process, but the real process is very complex, for example: 
    a.register push and pop, 
    b.progress communicate, 
    c.progress priority,
    d.PCB
    e.semaphoe
    etc.
6. My Computer window(disk partition)  
    ==> finish partly
    ==> read partitions root path items need to save to cache, for fastly get next time, and can reduce disk io...
    ==> partition volumn name
7. Setting window(select file, delete file, modify file) ==> 0%
8. Memory Simple Management 
    ==> can get memory information, but it looks like something wrong.
    ==> get memory information successfully.
9. Multi Windows, button click event. ==> 10%
10. Application. ==>10%
11. How to Automated Testing? ==>0%
12. Graphics run slowly. ===> need to fix the bug.
13. Desk wallpaper display successfully..
14. Need to rule naming, about function name, variable name, struct name, and etc.
    a.function name ruled
    b.
    c.
    d.
    e.


current problems:

UINT16 LogStatusErrorCount = 0;

UINT16 StatusErrorCount = 0;
UINT16 DisplayCount = 0;
UINTN PartitionCount = 0;

UINT16 DebugPrintX = 0;
UINT16 DebugPrintY = 0; 

INT8 DisplayRootItemsFlag = 0;
INT8 DisplayMyComputerFlag = 0;
INT8 DisplaySystemLogWindowFlag = 0;
INT8 DisplaySystemSettingWindowFlag = 0;
INT8 DisplayMemoryInformationWindowFlag = 0;
INT8 DisplayStartMenuFlag = 0;

EFI_GRAPHICS_OUTPUT_PROTOCOL       *GraphicsOutput = NULL;

EFI_HANDLE *handle;

UINT8 *pDeskBuffer = NULL; //only Desk layer include wallpaper and button : 1
UINT8 *pMyComputerBuffer = NULL; // MyComputer layer: 2
UINT8 *pSystemLogWindowBuffer = NULL; // MyComputer layer: 2
UINT8 *pMemoryInformationBuffer = NULL; // MyComputer layer: 2
UINT8 *pDeskDisplayBuffer = NULL; //desk display after multi graphicses layers compute
UINT8 *pSystemIconBuffer[SYSTEM_ICON_MAX]; //desk display after multi graphicses layers compute
UINT8 *pSystemIconMySettingBuffer = NULL; //after zoom in or zoom out
UINT8 *pSystemIconRecycleBuffer = NULL; //after zoom in or zoom out
UINT8 *pMouseSelectedBuffer = NULL;  // after mouse selected
UINT8 *pMouseClickBuffer = NULL; // for mouse click 
UINT8 *pDateTimeBuffer = NULL; //Mouse layer: 3
UINT8 *pMouseBuffer = NULL; //Mouse layer: 4
UINT8 *pSystemIconFolderBuffer = NULL; //after zoom in or zoom out
UINT8 *pSystemIconTextBuffer = NULL; //after zoom in or zoom out
UINT8 *pSystemIconTempBuffer2 = NULL;


// Read File 
UINT8 ReadFileName[20];
UINT8 *pReadFileDestBuffer = NULL;
UINT8 ReadFileNameLength = 0;
UINT16 FileReadCount = 0;

UINT8 *pDeskWallpaperBuffer = NULL;
UINT8 *pTestBuffer = NULL;

EFI_EVENT MultiTaskTriggerGroup0Event;
EFI_EVENT MultiTaskTriggerGroup1Event;
EFI_EVENT MultiTaskTriggerGroup2Event;

int Nodei = 0;

UINT8 *FAT32_Table = NULL;


UINT8 *pStartMenuBuffer = NULL;
UINT8 *pSystemSettingWindowBuffer = NULL;

UINT8 *sChineseChar = NULL;
//UINT8 sChineseChar[267616];


UINT16 MyComputerWidth = 16 * 40;
UINT16 MyComputerHeight = 16 * 50;

UINT16 SystemLogWindowWidth = 16 * 30;
UINT16 SystemLogWindowHeight = 16 * 40;

UINT16 MemoryInformationWindowWidth = 16 * 30;
UINT16 MemoryInformationWindowHeight = 16 * 40;

UINT16 MouseClickWindowWidth = 300;
UINT16 MouseClickWindowHeight = 400;

UINT16 SystemSettingWindowWidth = 16 * 10;
UINT16 SystemSettingWindowHeight = 16 * 10;

UINT16 StartMenuWidth = 16 * 10;
UINT16 StartMenuHeight = 16 * 20;

UINT64 sector_count = 0;
UINT32 FileBlockStart = 0;
UINT32 BlockSize = 0;
UINT32 FileLength = 0;
UINT32 PreviousBlockNumber = 0;


EFI_GRAPHICS_OUTPUT_BLT_PIXEL MouseColor;

UINT32 TimerSliceCount = 0;

UINT16 display_sector_number = 0;

typedef enum
{
    ALLOCATED_INFORMATION_DOMAIN_PHYSICAL_BLOCK_START = 0,
    ALLOCATED_INFORMATION_DOMAIN_PAGE_START,
    ALLOCATED_INFORMATION_DOMAIN_PAGE_COUNT,
    ALLOCATED_INFORMATION_DOMAIN_PHYSICAL_BLOCK_ID,
    ALLOCATED_INFORMATION_DOMAIN_MAX
}MEMORY_ALLOCATED_INFORMATION_DOMAIN;


typedef struct{
    UINT32 efi_loader_signature;
    UINT32 efi_systab;
    UINT32 efi_memdesc_size;
    UINT32 efi_memdesc_version;
    UINT32 efi_memmap;
    UINT32 efi_memmap_size;
    UINT32 efi_systab_hi;
    UINT32 efi_memmap_hi;
}efi_info_self;

typedef struct
{
    UINT64 addr;        /* start of memory segment */
    UINT64 size;        /* size of memory segment */
    UINT32 type;        /* type of memory segment */
}e820_entry_self;


//注意：FAT32分区的卷标存放在第2个簇前几个字符
//      NTFS分区的卷标存放在MFT表项$VOLUME表里
DEVICE_PARAMETER device[10] = {0};

/*
    struct for FAT32 file system
*/

typedef struct
{
    UINT8 JMP[3] ; // 0x00 3 跳转指令（跳过开头一段区域）
    UINT8 OEM[8] ; // 0x03 8 OEM名称常见值是MSDOS5.0.
    UINT8 BitsOfSector[2] ; // 0x0b 2 每个扇区的字节数。取值只能是以下几种：512，1024，2048或是4096。设为512会取得最好的兼容性
    UINT8 SectorOfCluster[1] ; // 0x0d 1 每簇扇区数。 其值必须中2的整数次方，同时还要保证每簇的字节数不能超过32K
    UINT8 ReservedSelector[2] ; // 0x0e 2 保留扇区数（包括启动扇区）此域不能为0，FAT12/FAT16必须为1，FAT32的典型值取为32
    UINT8 NumFATS[1] ; // 0x10 1 文件分配表数目。 NumFATS，任何FAT格式都建议为2
    UINT8 RootPathRecords[2] ; // 0x11 2 最大根目录条目个数, 0 for fat32, 512 for fat16
    UINT8 AllSectors[2] ; // 0x13 2 总扇区数（如果是0，就使用偏移0x20处的4字节值）0 for fat32
    UINT8 Description[1] ; // 0x15 1 介质描述 0xF8 单面、每面80磁道、每磁道9扇区
    UINT8 xxx1[2] ; // 0x16 2 每个文件分配表的扇区（FAT16）,0 for fat32
    UINT8 xxx2[2] ; // 0x18 2 每磁道的扇区, 0x003f
    UINT8 xxx3[2] ; // 0x1a 2 磁头数，0xff
    UINT8 xxx4[4] ; // 0x1c 4 隐藏扇区, 与MBR中地址0x1C6开始的4个字节数值相等
    UINT8 SectorCounts[4] ; // 0x20 4 总扇区数（如果超过65535使用此地址，小于65536参见偏移0x13，对FAT32，此域必须是非0）
    UINT8 SectorsPerFat[4] ; // Sectors count each FAT use
    UINT8 Fat32Flag[2] ; // 0x28 2 Flags (FAT32特有)
    UINT8 FatVersion[2] ; // 0x2a 2 版本号 (FAT32特有)
    UINT8 BootPathStartCluster[4] ; // 0x2c 4 根目录起始簇 (FAT32)，一般为2
    UINT8 ClusterName[11] ; // 0x2b 11 卷标（非FAT32）
    UINT8 BootStrap[2] ; // 0x30 2 FSInfo 扇区 (FAT32) bootstrap
    UINT8 BootSectorBackup[2] ; // 0x32 2 启动扇区备份 (FAT32)如果不为0，表示在保留区中引导记录的备数据所占的扇区数，通常为6同时不建议使用6以外的其他数值
    UINT8 Reserved[2] ; // 0x34 2 保留未使用 (FAT32) 此域用0填充
    UINT8 FileSystemType[8] ; // 0x36 8 FAT文件系统类型（如FAT、FAT12、FAT16）含"FAT"就是PBR,否则就是MBR
    UINT8 SelfBootCode[2] ; // 0x3e 2 操作系统自引导代码
    UINT8 DeviceNumber[1] ; // 0x40 1 BIOS设备代号 (FAT32)
    UINT8 NoUse[1] ; // 0x41 1 未使用 (FAT32)
    UINT8 Flag[1] ; // 0x42 1 标记 (FAT32)
    UINT8 SequeenNumber[4] ; // 0x43 4 卷序号 (FAT32)
    UINT8 juanbiao[11] ; // 0x47 11 卷标（FAT32）
    UINT8 TypeOfFileSystem[8] ; // 0x52 8 FAT文件系统类型（FAT32）
    UINT8 BootAssembleCode[338]; // code
    UINT8 Partition1[16] ; // 0x1be 64 partitions table, DOS_PART_TBL_OFFSET
    UINT8 Partition2[16] ; // 0X1BE ~0X1CD 16 talbe entry for Partition 1
    UINT8 Partition3[16] ; // 0X1CE ~0X1DD 16 talbe entry for Partition 2
    UINT8 Partition4[16] ; // 0X1DE ~0X1ED 16 talbe entry for Partition 3
    UINT8 EndFlag[2] ; // 0x1FE 2 扇区结束符（0x55 0xAA） 结束标志：MBR的结束标志与DBR，EBR的结束标志相同。
}MasterBootRecord;

/*
    struct for NTFS file system
*/

// NTFS first sector
// first sector of partition
typedef struct
{
    UINT8 JMP[3] ; // 0x00 3 跳转指令（跳过开头一段区域）
    UINT8 OEM[8] ; // 0x03 8 OEM名称常见值是MSDOS5.0, NTFS.

    // 0x0B
    UINT8 BitsOfSector[2];        //  0x0200　　扇区大小，512B
    UINT8 SectorOfCluster;            //  0x08　　  每簇扇区数，4KB
    UINT8 ReservedSelector[2];            // 　　　　　　保留扇区
    UINT8 NoUse01[5];            //
    
    // 0x15
    UINT8 Description;            //  0xF8     
    
    // 磁盘介质 -- 硬盘
    UINT8 NoUse02[2];            //
    
    // 0x18
    UINT8 SectorPerTrack[2];     // 　0x003F 　每道扇区数 63
    UINT8 Headers[2];           //　 0x00FF  磁头数
    UINT8 SectorsHide[4];          // 　0x3F　　隐藏扇区
    UINT8 NoUse03[8];           //
    
    // 0x28
    UINT8 AllSectorCount[8];        // 卷总扇区数, 高位在前, 低位在后
    
    // 0x30
    UINT8 MFT_StartCluster[8];      // MFT 起始簇
    UINT8 MFT_MirrStartCluster[8];  // MTF 备份 MFTMirr 位置
    
    //0x40
    UINT8 ClusterPerMFT[4];    // 每记录簇数 0xF6
    UINT8 ClusterPerIndex[4];    // 每索引簇数
    
    //0x48
    UINT8 SerialNumber[8];    // 卷序列号
    UINT8 CheckSum[8];    // 校验和
    UINT8 EndFlag[2];    // 0x1FE 2 扇区结束符（0x55 0xAA） 结束标志：MBR的结束标志与DBR，EBR的结束标志相同。
}DOLLAR_BOOT;


typedef struct 
{
    UINT16 BitsOfSector;
    UINT16 SectorOfCluster; 
    UINT64 AllSectorCount;
    UINT64 MFT_StartCluster;
    UINT64 MFT_MirrStartCluster;
}DollarBootSwitched;

MasterBootRecordSwitched MBRSwitched;
DollarBootSwitched NTFSBootSwitched;

#pragma  pack(1)
typedef struct     //这个结构体就是对上面那个图做一个封装。
{
    //bmp header
    UINT8  Signatue[2] ;   // B  M
    UINT8 FileSize[4] ;     //文件大小
    UINT8 Reserv1[2] ; 
    UINT8 Reserv2[2] ; 
    UINT8 FileOffset[4] ;   //文件头偏移量

    //DIB header
    UINT8 DIBHeaderSize[4] ; //DIB头大小
    UINT8 ImageWidth[4]   ;  //文件宽度
    UINT8 ImageHight[4]   ;  //文件高度
    UINT8 Planes[2]       ; 
    UINT8 BPP[2]          ;  //每个相素点的位数
    UINT8 Compression[4]  ; 
    UINT8 ImageSize[4]    ;  //图文件大小
    UINT8 XPPM[4] ; 
    UINT8 YPPM[4] ; 
    UINT8 CCT[4] ; 
    UINT8 ICC[4] ;          
}BMP_HEADER;
