/** @file
  FrontPage routines to handle the callbacks and browser calls

Copyright (c) 2004 - 2017, Intel Corporation. All rights reserved.<BR>
(C) Copyright 2018 Hewlett Packard Enterprise Development LP<BR>
SPDX-License-Identifier: BSD-2-Clause-Patent
ToDo:

1. ReadFileFromPath; OK
2. Fix trigger event with mouse and keyboard; OK
3. NetWork connect baidu.com; ==> driver not found
4. File System Simple Management; ==> current can read and write, Sub directory read.
5. progcess; ==> current mouse move, keyboard input, read file they can similar to process, but the real process is very complex, for example: 
	a.register push and pop, 
	b.progress communicate, 
	c.progress priority,
	d.PCB
	e.semaphoe
	etc.
6. My Computer window(disk partition)  ==> finish partly
7. Setting window(select file, delete file, modify file) ==> 0%
8. Memory Simple Management ==> can get memory infomation, but it looks like something wrong.
9. Multi Windows, button click event. ==> 10%
10. Application. ==>10%
11. How to Automated Testing? ==>0%
12. Graphics run slowly. ===> need to fix the bug.
**/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <Library/BaseLib.h>

#include <Guid/ConsoleInDevice.h>
#include <Guid/ConsoleOutDevice.h>
#include <Guid/FileSystemVolumeLabelInfo.h>
#include <Guid/GlobalVariable.h>
#include <Guid/HiiBootMaintenanceFormset.h>
#include <Guid/MdeModuleHii.h>
#include <Guid/ShellLibHiiGuid.h>

#include <Protocol/UnicodeCollation.h>
#include <Protocol/DiskIo.h>
#include <Protocol/BlockIo.h>
#include <Protocol/DiskIo2.h>
#include <Protocol/BlockIo2.h>

UINT16 date_time_count = 0;
UINT16 keyboard_count = 0;
UINT16 mouse_count = 0;
UINT16 parameter_count = 0;

#define INFO(...)   \
			do {   \
				  Print(L"[INFO  ]%a %a(Line %d): ", __FILE__,__FUNCTION__,__LINE__);  \
			     Print(__VA_ARGS__); \
			}while(0);


//Line 0
#define DISPLAY_DESK_HEIGHT_WEIGHT_X (date_time_count % 30) 
#define DISPLAY_DESK_HEIGHT_WEIGHT_Y (0)

//Line 1
#define DISPLAY_MOUSE_X (0) 
#define DISPLAY_MOUSE_Y (16 * 1)

#define KEYBOARD_BUFFER_LENGTH (30) 

int keyboard_input_count = 0;
char pKeyboardInputBuffer[KEYBOARD_BUFFER_LENGTH] = {0};

//Line 2
#define DISPLAY_KEYBOARD_X (0) 
#define DISPLAY_KEYBOARD_Y (16 * 2)

//Line 3
#define TEXT_DEVICE_PATH_X (0) 
#define TEXT_DEVICE_PATH_Y (16 * 4)

//Line 18
#define DISK_READ_X (0) 
#define DISK_READ_Y (16 * 19)

//Line 18
#define DISK_READ_X (0) 
#define DISK_READ_Y (16 * 19)

// Line 22

#define DISK_READ_BUFFER_X (0) 
#define DISK_READ_BUFFER_Y (6 * 56)

#define DISK_MBR_X (0) 
#define DISK_MBR_Y (16 * 62)


//last Line
#define DISPLAY_DESK_DATE_TIME_X (ScreenWidth - 20 * 8) 
#define DISPLAY_DESK_DATE_TIME_Y (ScreenHeight - 21)


#define DISK_BUFFER_SIZE (512)
#define DISK_BLOCK_BUFFER_SIZE (512 * 8)
#define DISK_MFT_BUFFER_SIZE (512 * 2 * 15)
#define EXBYTE	4


#define E820_RAM		1
#define E820_RESERVED		2
#define E820_ACPI		3
#define E820_NVS		4
#define E820_UNUSABLE		5

#define LLONG_MIN  (((INT64) -9223372036854775807LL) - 1)
#define LLONG_MAX   ((INT64)0x7FFFFFFFFFFFFFFFULL)


UINT16 StatusErrorCount = 0;
// For exception returned status 
#define DISPLAY_ERROR_STATUS_X (ScreenWidth * 2 / 4) 
#define DISPLAY_ERROR_STATUS_Y (16 * (StatusErrorCount++ % 61) )


UINT16 DisplayCount = 0;
// For exception returned status 
#define DISPLAY_X (0) 
#define DISPLAY_Y (16 * (2 + DisplayCount++ % 52) )

UINTN NumHandles = 0;

CHAR8 x_move = 0;
CHAR8 y_move = 0;

UINT16 DebugPrintX = 0;
UINT16 DebugPrintY = 0; 

CHAR8    AsciiBuffer[0x100] = {0};


#define DEBUG_STATUS_2(x, y, Express)  DebugPrint1(x, y,IN CONST CHAR8 * Format,...)

#define DEBUG_STATUS(x, y, Express)	 DEBUG_STATUS_2(x, y, "message(%s, %s(), %d): ", __FILE__, __FUNCTION__, __LINE__); 

EFI_GRAPHICS_OUTPUT_PROTOCOL       *GraphicsOutput;
EFI_SIMPLE_POINTER_PROTOCOL        *gMouse;

extern EFI_SIMPLE_FILE_SYSTEM_PROTOCOL *gSimpleFileSystem; 

UINT8 *pMyComputerBuffer = NULL;

EFI_HANDLE *handle;

UINT8 *pDeskBuffer = NULL;
UINT8 *pDeskDisplayBuffer = NULL; //desk display after multi graphicses layers compute
UINT8 *pMouseSelectedBuffer = NULL;  // after mouse selected
UINT8 *pMouseClickBuffer = NULL; // for mouse click 
UINT8 *pMouseBuffer = NULL;

typedef enum
{
	GRAPHICS_LAYER_DESK = 0,
	GRAPHICS_LAYER_MY_COMPUTER
}GRAPHICS_LAYER_ID;


struct efi_info_self {
	UINT32 efi_loader_signature;
	UINT32 efi_systab;
	UINT32 efi_memdesc_size;
	UINT32 efi_memdesc_version;
	UINT32 efi_memmap;
	UINT32 efi_memmap_size;
	UINT32 efi_systab_hi;
	UINT32 efi_memmap_hi;
};

struct e820_entry_self {
	UINT64 addr;		/* start of memory segment */
	UINT64 size;		/* size of memory segment */
	UINT32 type;		/* type of memory segment */
};


typedef struct
{
	UINT16 DeviceType; // 0 Disk, 1: USB, 2: Sata;
	UINT16 PartitionType; // 0 MBR, 1 GPT;
	UINT16 PartitionID; // a physics device consist of Several parts like c: d: e:
	UINT16 PartitionGUID; // like FA458FD2-4FF7-44D8-B542-BA560A5990B3
	UINT16 DeviceSquenceID; //0025384961B47ECD
	char Signare[50]; // MBR:0x077410A0
	long long StartSectorNumber; //0x194000
	long long SectorCount; //0xC93060
}DEVICE_PARAMETER;

/*
    struct for FAT32 file system
*/

typedef struct
{
	UINT8 JMP[3] ; // 0x00 3 跳转指令（跳过开头一段区域）
	UINT8 OEM[8] ; // 0x03 8 OEM名称常见值是MSDOS5.0.
	UINT8 BitsOfSector[2] ; // 0x0b 2 每个扇区的字节数。取值只能是以下几种：512，1024，2048或是4096。设为512会取得最好的兼容性
	UINT8 SectorOfCluster[1] ; // 0x0d 1 每簇扇区数。 其值必须中2的整数次方，同时还要保证每簇的字节数不能超过32K
	UINT8 ReservedSelector[2] ; // 0x0e 2 保留扇区数（包括启动扇区）此域不能为0，FAT12/FAT16必须为1，FAT32的典型值取为32
	UINT8 NumFATS[1] ; // 0x10 1 文件分配表数目。 NumFATS，任何FAT格式都建议为2
	UINT8 RootPathRecords[2] ; // 0x11 2 最大根目录条目个数, 0 for fat32, 512 for fat16
	UINT8 AllSectors[2] ; // 0x13 2 总扇区数（如果是0，就使用偏移0x20处的4字节值）0 for fat32
	UINT8 Description[1] ; // 0x15 1 介质描述 0xF8 单面、每面80磁道、每磁道9扇区
	UINT8 xxx1[2] ; // 0x16 2 每个文件分配表的扇区（FAT16）,0 for fat32
	UINT8 xxx2[2] ; // 0x18 2 每磁道的扇区, 0x003f
	UINT8 xxx3[2] ; // 0x1a 2 磁头数，0xff
	UINT8 xxx4[4] ; // 0x1c 4 隐藏扇区, 与MBR中地址0x1C6开始的4个字节数值相等
	UINT8 SectorCounts[4] ; // 0x20 4 总扇区数（如果超过65535使用此地址，小于65536参见偏移0x13，对FAT32，此域必须是非0）
	UINT8 SectorsPerFat[4] ; // Sectors count each FAT use
	UINT8 Fat32Flag[2] ; // 0x28 2 Flags (FAT32特有)
	UINT8 FatVersion[2] ; // 0x2a 2 版本号 (FAT32特有)
	UINT8 BootPathStartCluster[4] ; // 0x2c 4 根目录起始簇 (FAT32)，一般为2
	UINT8 ClusterName[11] ; // 0x2b 11 卷标（非FAT32）
	UINT8 BootStrap[2] ; // 0x30 2 FSInfo 扇区 (FAT32) bootstrap
	UINT8 BootSectorBackup[2] ; // 0x32 2 启动扇区备份 (FAT32)如果不为0，表示在保留区中引导记录的备数据所占的扇区数，通常为6同时不建议使用6以外的其他数值
	UINT8 Reserved[2] ; // 0x34 2 保留未使用 (FAT32) 此域用0填充
	UINT8 FileSystemType[8] ; // 0x36 8 FAT文件系统类型（如FAT、FAT12、FAT16）含"FAT"就是PBR,否则就是MBR
	UINT8 SelfBootCode[2] ; // 0x3e 2 操作系统自引导代码
	UINT8 DeviceNumber[1] ; // 0x40 1 BIOS设备代号 (FAT32)
	UINT8 NoUse[1] ; // 0x41 1 未使用 (FAT32)
	UINT8 Flag[1] ; // 0x42 1 标记 (FAT32)
	UINT8 SequeenNumber[4] ; // 0x43 4 卷序号 (FAT32)
	UINT8 juanbiao[11] ; // 0x47 11 卷标（FAT32）
	UINT8 TypeOfFileSystem[8] ; // 0x52 8 FAT文件系统类型（FAT32）
	UINT8 BootAssembleCode[338]; // code
	UINT8 Partition1[16] ; // 0x1be 64 partitions table, DOS_PART_TBL_OFFSET
	UINT8 Partition2[16] ; // 0X1BE ~0X1CD 16 talbe entry for Partition 1
	UINT8 Partition3[16] ; // 0X1CE ~0X1DD 16 talbe entry for Partition 2
	UINT8 Partition4[16] ; // 0X1DE ~0X1ED 16 talbe entry for Partition 3
	UINT8 EndFlag[2] ; // 0x1FE 2 扇区结束符（0x55 0xAA） 结束标志：MBR的结束标志与DBR，EBR的结束标志相同。
}MasterBootRecord;

/*
    struct for NTFS file system
*/

//
// first sector of partition
typedef struct
{
	UINT8 JMP[3] ; // 0x00 3 跳转指令（跳过开头一段区域）
	UINT8 OEM[8] ; // 0x03 8 OEM名称常见值是MSDOS5.0, NTFS.

	// 0x0B
	UINT8 BitsOfSector[2];        //  0x0200　　扇区大小，512B
	UINT8 SectorOfCluster;            //  0x08　　  每簇扇区数，4KB
	UINT8 ReservedSelector[2];            // 　　　　　　保留扇区
	UINT8 NoUse01[5];            //
	
	// 0x15
	UINT8 Description;            //  0xF8     
	
	// 磁盘介质 -- 硬盘
	UINT8 NoUse02[2];            //
	
	// 0x18
	UINT8 SectorPerTrack[2];     // 　0x003F 　每道扇区数 63
	UINT8 Headers[2];           //　 0x00FF  磁头数
	UINT8 SectorsHide[4];          // 　0x3F　　隐藏扇区
	UINT8 NoUse03[8];           //
	
	// 0x28
	UINT8 AllSectorCount[8];        // 卷总扇区数, 高位在前, 低位在后
	
	// 0x30
	UINT8 MFT_StartCluster[8];      // MFT 起始簇
	UINT8 MFT_MirrStartCluster[8];  // MTF 备份 MFTMirr 位置
	
	//0x40
	UINT8 ClusterPerMFT[4];    // 每记录簇数 0xF6
	UINT8 ClusterPerIndex[4];    // 每索引簇数
	
	//0x48
	UINT8 SerialNumber[8];    // 卷序列号
	UINT8 CheckSum[8];    // 校验和
	UINT8 EndFlag[2];    // 0x1FE 2 扇区结束符（0x55 0xAA） 结束标志：MBR的结束标志与DBR，EBR的结束标志相同。
}DOLLAR_BOOT;


typedef struct 
{
	UINT16 BitsOfSector;
	UINT16 SectorOfCluster;	
	UINT64 AllSectorCount;
	UINT64 MFT_StartCluster;
	UINT64 MFT_MirrStartCluster;
}DollarBootSwitched;


// MFT记录了整个卷的所有文件 (包括MFT本身、数据文件、文件夹等等) 信息，包括空间占用，文件基本属性，文件位置索引，创建时
// MFT 的第一项记录$MFT描述的是主分区表MFT本身，它的编号为0，MFT项的头部都是如下结构：
typedef struct {
	 UINT8    mark[4];             // "FILE" 标志 
	 UINT8    UsnOffset[2];        // 更新序列号偏移 　　　　30 00
	 UINT8    usnSize[2];          // 更新序列数组大小+1 　 03 00
	 UINT8    LSN[8];              // 日志文件序列号(每次记录修改后改变)  58 8E 0F 34 00 00 00 00
	// 0x10
	 UINT8    SN[2];               // 序列号 随主文件表记录重用次数而增加
	 UINT8    linkNum[2];          // 硬连接数 (多少目录指向该文件) 01 00
	 UINT8    firstAttr[2];        // 第一个属性的偏移　　38 00
	 UINT8    flags[2];            // 0已删除 1正常文件 2已删除目录 3目录正使用
	// 0x18
	 UINT8    MftUseLen[4];        // 记录有效长度   　A8 01 00 00
	 UINT8    maxLen[4];            // 记录占用长度 　 00 04 00 00
	// 0x20
	 UINT8    baseRecordNum[8];     // 索引基本记录, 如果是基本记录则为0
	 UINT8    nextAttrId[2];        // 下一属性Id　　07 00
	 UINT8    border[2];            //
	 UINT8    xpRecordNum[4];       // 用于xp, 记录号
	// 0x30
	 UINT8    USN[8];                 // 更新序列号(2B) 和 更新序列数组
}MFT_HEADER;

/*
	MFT 是由一条条 MFT 项(记录)所组成的，而且每项大小是固定的(一般为1KB = 2 * 512)，MFT保留了前16项用于特殊文件记录，称为元数据，
	元数据在磁盘上是物理连续的，编号为0~15；如果$MFT的偏移为0x0C0000000, 那么下一项的偏移就是0x0C0000400，在下一项就是
	0x0C0000800等等；
*/

//------------------  属性头通用结构 ----
typedef struct  //所有偏移量均为相对于属性类型 Type 的偏移量
{
	 UINT8 Type[4];           // 属性类型 0x10, 0x20, 0x30, 0x40,...,0xF0,0x100
	 UINT8 Length[4];         // 属性的长度
	 UINT8 NonResidentFiag;   // 是否是非常驻属性，l 为非常驻属性，0 为常驻属性 00
	 UINT8 NameLength;        // 属性名称长度，如果无属性名称，该值为 00
	 UINT8 ContentOffset[2];  // 属性内容的偏移量  18 00
	 UINT8 CompressedFiag[2]; // 该文件记录表示的文件数据是否被压缩过 00 00
	 UINT8 Identify[2];       // 识别标志  00 00
	//--- 0ffset: 0x10 ---
	//--------  常驻属性和非常驻属性的公共部分 ----
	union CCommon
	{
	
		//---- 如果该属性为 常驻 属性时使用该结构 ----
		struct CResident
		{
			 UINT8 StreamLength[4];        // 属性值的长度, 即属性具体内容的长度。"48 00 00 00"
			 UINT8 StreamOffset[2];        // 属性值起始偏移量  "18 00"
			 UINT8 IndexFiag[2];           // 属性是否被索引项所索引，索引项是一个索引(如目录)的基本组成  00 00
		};
		
		//------- 如果该属性为 非常驻 属性时使用该结构 ----
		struct CNonResident
		{
			 UINT8 StartVCN[8];            // 起始的 VCN 值(虚拟簇号：在一个文件中的内部簇编号,0起）
			 UINT8 LastVCN[8];             // 最后的 VCN 值
			 UINT8 RunListOffset[2];       // 运行列表的偏移量
			 UINT8 CompressEngineIndex[2]; // 压缩引擎的索引值，指压缩时使用的具体引擎。
			 UINT8 Reserved[4];
			 UINT8 StreamAiiocSize[8];     // 为属性值分配的空间 ，单位为B，压缩文件分配值小于实际值
			 UINT8 StreamRealSize[8];      // 属性值实际使用的空间，单位为B
			 UINT8 StreamCompressedSize[8]; // 属性值经过压缩后的大小, 如未压缩, 其值为实际值
		};
	};
}NTFSAttribute;

struct Value0x10
{
    UINT8 fileCreateTime[8];    // 文件创建时间
    UINT8 fileChangeTime[8];    // 文件修改时间
    UINT8 MFTChangeTime[8];     // MFT修改时间
    UINT8 fileLatVisited[8];    // 文件最后访问时间
    UINT8 tranAtrribute[4];     // 文件传统属性
    UINT8 otherInfo[28];        // 版本，所有者，配额，安全等等信息(详细略)
    UINT8 updataNum[8];         // 文件更新序列号
};

//------- 这个结构只是数据内容部分，不包括属性头 NTFSAttribute ---- //------- 由属性头的属性值偏移量确定属性值的起始位置 --- 1 
struct Value0x20
{
    UINT8 type[4];           // 类型
    UINT8 recordType[2];     // 记录类型
    UINT8 nameLen[2];        // 属性名长度
    UINT8 nameOffset;        // 属性名偏移
    UINT8 startVCN[8];       // 起始 VCN
    UINT8 baseRecordNum[8];  // 基本文件记录索引号
    UINT8 attributeId[2];    // 属性 id
   //---- 属性名(Unicode) 长度取决于 nameLen 的值 ---
 };
 
 struct Value0x30
{
     UINT8 parentFileNum[8];     // 父目录的文件参考号,前6B
     UINT8 createTime[8];        // 文件创建时间
     UINT8 changeTime[8];        // 文件修改时间
     UINT8 MFTchangeTime[8];     // MFT 修改时间
     UINT8 lastVisitTime[8];      // 最后一次访问时间
     UINT8 AllocSize[8];         // 文件分配大小
     UINT8 realSize[8];          // 实际大小
     UINT8 fileFlag[4];          // 文件标志，系统 隐藏 压缩等等
     UINT8 EAflags[4];            // EA扩展属性和重解析点
     UINT8 nameLength;           // 文件名长
     UINT8 nameSpace;            // 文件命名空间
    //----- Name (Unicode编码) 长度为 2 * nameLength ----
};

typedef struct
{
     UINT8 GObjectId[16];            // 全局对象ID 给文件的唯一ID号
     UINT8 GOriginalVolumeId[16];    // 全局原始卷ID 永不改变
     UINT8 GOriginalObjectId[16];    // 全局原始对象ID 派给本MFT记录的第一个对象ID
     UINT8 GDomain[16];              // 全局域ID (未使用)
}Value0x40;


// may be have some errors
#define N 127

// todo
 struct Value0x60
 {
     //---- 通用属性头 --
      UINT8 VolumeName[N];    //(Unicode) N 最大为 127 外加一个结束符'\0'
 };

struct Value0x70
{    //----- 通用属性头 ---
     UINT8 noUsed1[8];        // 00
     UINT8 mainVersion;       // 主版本号 1--winNT, 3--Win2000/XP
     UINT8 SecVersion;        // 次版本号 当主为3, 0--win2000, 1--WinXP/7
     UINT8 flag[2];           // 标志
     UINT8 noUsed2[4];        // 00
};
/* flag:
*  0x0001  坏区标志 下次重启时chkdsk/f进行修复
*  0x0002  调整日志文件大小
*  0x0004  更新装载
*  0x0008  装载到 NT4
*  0x0010  删除进行中的USN
*  0x0020  修复对象 Ids
*  0x8000  用 chkdsk 修正卷
*/

struct indexHeader
{
     UINT8 type[4];             //  属性类型
     UINT8 checkRule[4];        // 校对规则
     UINT8 allocSize[4];        // 索引项分配大小
     UINT8 CluPerIdx;           // 每索引记录的簇数
     UINT8 noUse01[3];          // 填充

     UINT8 firstIdxOffset[4];    // 第一个索引项偏移
     UINT8 idxTotalSize[4];      // 索引项总大小
     UINT8 indxAllocSize[4];     // 索引项分配大小
     UINT8 flag;                 // 标志
     UINT8 noUse02[3];
};


// 一般小目录在90属性中有常驻目录项，目录项的结构与INDX缓存中的目录项一样
struct indexItem
{
     UINT8 MFTnum[8];               // 文件的 MFT 记录号，前6B是MFT编号,用于定位此文件记录
     UINT8 ItemLen[2];              // 索引项大小
     UINT8 IndexIdentifier[2];      // 索引标志 R
     UINT8 isNode[2];                // 1---此索引包含一个子节点，0---此为最后一项
     UINT8 noUse03[2];               // 填充
     UINT8 FMFTnum[8];               // 父目录 MFT文件参考号 0x05表示根目录
     UINT8 CreateTime[8];            //文件创建时间
     UINT8 fileModifyTime[8];        //文件修改时间
     UINT8 MFTModifyTime[8];         //文件记录最后修改时间
     UINT8 LastVisitTime[8];         //文件最后访问时间
     UINT8 FileAllocSize[8];         //文件分配大小 (B)
     UINT8 FileRealSize[8];          //文件实际大小 (B)
     UINT8 FileIdentifier[8];        //文件标志
     UINT8 FileNameLen;              //文件名长度
     UINT8 FileNameSpace;            //文件名命名空间
	 //---- 0x52 ---
    //FileName;                     // 文件名 (末尾填满 8 字节)
     UINT8 nextItemVCN[8];           // 下一项的 VCN (有子节点才有)
};

struct indxHeader    // A0H外部缓存文件结构，最大长度一般为4K
{
     UINT8 mark[4];        //  标志 "INDX"
     UINT8 usnOffset[2];   // 更新序列偏移
     UINT8 usnSize[2];     // 更新序列数组大小S
     UINT8 LSN[8];         // 日志文件序列号
     UINT8 indxVCN[8];     // 本索引缓存在分配索引中的VCN
     UINT8 itemOffset[4];  // 第一项索引的偏移(从这里开始计算)
     UINT8 itemSize[4];    // 索引项实际大小(B)
     UINT8 itemAlloc[4];   // 索引项分配大小(B)(不包括头部) 略小于4K
     UINT8 isNode;         // 是结点置1，表示有子节点
     UINT8 noUse[3];
    // UINT8 USN[2S];      // 更新序列号和数组
};



typedef struct 
{
	UINT16 ReservedSelector;
	UINT16 SectorsPerFat;	
	UINT16 BootPathStartCluster;
	UINT16 NumFATS;
	UINT16 SectorOfCluster;
}MasterBootRecordSwitched;

typedef struct 
{
	UINT8 FileName[8];
	UINT8 ExtensionName[3];

	// 00000000(Read/Write)
    // 00000001(ReadOnly)
    // 00000010(Hide)
    // 00000100(System)
    // 00001000(Volume name)
    // 00010000(Sub path)
    // 00100000(FILING: guidang)
	UINT8 Attribute[1];  // if 0x0FH then Long path structor
	UINT8 Reserved[1];
	UINT8 CreateTimeLow[1];
	UINT8 CreateTimeHigh[2];
	UINT8 CreateDate[2];
	UINT8 LatestVisitedDate[2];
	UINT8 StartClusterHigh2B[2];
	UINT8 LatestModiedTime[2];
	UINT8 LatestModiedDate[2];
	UINT8 StartClusterLow2B[2]; //*
	UINT8 FileLength[4];
}FAT32_ROOTPATH_SHORT_FILE_ITEM;

typedef struct 
{
	UINT8 Reserved[1];
	UINT8 CreateTimeLow[1];
	UINT8 CreateTimeHigh[2];
	UINT8 CreateDate[2];
	UINT8 LatestVisitedDate[2];
	UINT8 StartClusterHigh2B[2];
	UINT8 LatestModiedTime[2];
	UINT8 LatestModiedDate[2];
	UINT8 StartClusterLow2B[2]; //*
	UINT8 FileLength[4];
}FAT32_ROOTPATH_SHORT_FILE_ITEMSwitched;


typedef struct 
{
	UINT8 FileName[8];
	UINT8 ExtensionName[3];
	UINT8 Attribute[1];  // if 0x0FH then Long path structor
	UINT8 Reserved[1];
	UINT8 CreateTimeLow[1];
	UINT8 CreateTimeHigh[2];
	UINT8 CreateDate[2];
	UINT8 LatestVisitedDate[2];
	UINT8 StartClusterHigh2B[2];
	UINT8 LatestModiedTime[2];
	UINT8 LatestModiedDate[2];
	UINT8 StartClusterLow2B[2]; //*
	UINT8 FileLength[4];
}FAT32_ROOTPATH_LONG_FILE_ITEM;


typedef struct 
{
	UINT16 ReservedSelector;
	UINT16 SectorsPerFat;	
	UINT16 BootPathStartCluster;
	UINT16 NumFATS;
}ROOT_PATH;

/*目录项首字节含义*/
enum DirFirstChar
{
	DirUnUsed            = 0x00,        /*本表项没有使用*/
	DirCharE5            = 0x05,        /*首字符为0xe5*/
	DirisSubDir          = 0x2e,        /*是一个子目录 .,..为父目录*/
	DirFileisDeleted     = 0xe5        /*文件已删除*/
};


typedef struct {
  UINTN               Signature;
  EFI_FILE_PROTOCOL   Handle;
  UINT64              Position;
  BOOLEAN             ReadOnly;
  LIST_ENTRY          Tasks;                  // List of all FAT_TASKs
  LIST_ENTRY          Link;                   // Link to other IFiles
} FAT_IFILE;


typedef struct {
  UINTN               Signature;
  EFI_FILE_IO_TOKEN   *FileIoToken;
  FAT_IFILE           *IFile;
  LIST_ENTRY          Subtasks;               // List of all FAT_SUBTASKs
  LIST_ENTRY          Link;                   // Link to other FAT_TASKs
} FAT_TASK;


typedef struct {
  UINTN               Signature;
  EFI_DISK_IO2_TOKEN  DiskIo2Token;
  FAT_TASK            *Task;
  BOOLEAN             Write;
  UINT64              Offset;
  VOID                *Buffer;
  UINTN               BufferSize;
  LIST_ENTRY          Link;
} DISK_HANDLE_TASK;

DISK_HANDLE_TASK  disk_handle_task;

UINT8 *FAT32_Table;

UINT8 *sChineseChar = NULL;
//UINT8 sChineseChar[267616];

UINT8 HZK16FileReadCount = 0;
static UINTN ScreenWidth, ScreenHeight;  
UINT16 MyComputerWidth = 16 * 15;
UINT16 MyComputerHeight = 16 * 30;
UINT16 MyComputerPositionX = 700;
UINT16 MyComputerPositionY = 160;
UINT16 MouseClickWindowWidth = 300;
UINT16 MouseClickWindowHeight = 400;


UINT64 sector_count = 0;
UINT32 FileBlockStart = 0;
UINT32 BlockSize = 0;
UINT32 FileLength = 0;
UINT32 PreviousBlockNumber = 0;


DEVICE_PARAMETER device[10] = {0};



int iMouseX;
int iMouseY;

EFI_GRAPHICS_OUTPUT_BLT_PIXEL MouseColor;

typedef struct 
{
	UINT16 ButtonStartX;
	UINT16 ButtonStartY;
	UINT16 Width;
	UINT16 Height;
	UINT16 Type;  // Big, Small, 
}BUTTON;


typedef struct 
{
	UINT8 *pBuffer;
	UINT16 Width;
	UINT16 Height;
	UINT16 LastWidth;  // for switch between maximize and normal
	UINT16 LastHeight; // for switch between maximize and normal
	UINT16 CurrentX;   // new input text start with x
	UINT16 CurrentY;   // new input text start with y
	UINT16 TextStartX; // text start with x
	UINT16 TextStartY; // text start with y
	UINT16 WindowStartX; // Window left-top
	UINT16 WindowStartY; // Window left-top
	UINT16 Type;  // Big, Small, 
	
	UINT16 NextState; // maximize; minimize; other
	CHAR8 pTitle[50];
	BUTTON *pButtons;
} WINDOW;


// we need a FSM（Finite State Machine）to Read content of file

// init -> partition analysised -> root path analysised -> read fat table -> start read file -> reading a file -> read finished
typedef enum
{
	INIT_STATE = 0,
	GET_PARTITION_INFO_STATE,
	GET_ROOT_PATH_INFO_STATE,
	GET_FAT_TABLE_STATE,
	READ_FILE_STATE,
}STATE;

typedef enum
{
	READ_PATITION_EVENT = 0,
	READ_ROOT_PATH_EVENT,
	READ_FAT_TABLE_EVENT,
	READ_FILE_EVENT,
}EVENT;

typedef struct
{
	STATE	       CurrentState;
	EVENT	       event;
	STATE	       NextState;
	EFI_STATUS    (*pFunc)(); 
}STATE_TRANS;





const UINT8 sASCII[][16] =
{   
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x00
    {0x00,0x00,0x7E,0x81,0xA5,0x81,0x81,0xBD,0x99,0x81,0x81,0x7E,0x00,0x00,0x00,0x00},       //0x01
    {0x00,0x00,0x7E,0xFF,0xDB,0xFF,0xFF,0xC3,0xE7,0xFF,0xFF,0x7E,0x00,0x00,0x00,0x00},       //0x02
    {0x00,0x00,0x00,0x00,0x6C,0xFE,0xFE,0xFE,0xFE,0x7C,0x38,0x10,0x00,0x00,0x00,0x00},       //0x03
    {0x00,0x00,0x00,0x00,0x10,0x38,0x7C,0xFE,0x7C,0x38,0x10,0x00,0x00,0x00,0x00,0x00},       //0x04
    {0x00,0x00,0x00,0x18,0x3C,0x3C,0xE7,0xE7,0xE7,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x05
    {0x00,0x00,0x00,0x18,0x3C,0x7E,0xFF,0xFF,0x7E,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x06
    {0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x3C,0x3C,0x18,0x00,0x00,0x00,0x00,0x00,0x00},       //0x07
    {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xE7,0xC3,0xC3,0xE7,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF},       //0x08
    {0x00,0x00,0x00,0x00,0x00,0x3C,0x66,0x42,0x42,0x66,0x3C,0x00,0x00,0x00,0x00,0x00},       //0x09
	{0xFF,0xFF,0xFF,0xFF,0xFF,0xC3,0x99,0xBD,0xBD,0x99,0xC3,0xFF,0xFF,0xFF,0xFF,0xFF},       //0x0A
    {0x00,0x00,0x1E,0x0E,0x1A,0x32,0x78,0xCC,0xCC,0xCC,0xCC,0x78,0x00,0x00,0x00,0x00},       //0x0B
    {0x00,0x00,0x3C,0x66,0x66,0x66,0x66,0x3C,0x18,0x7E,0x18,0x18,0x00,0x00,0x00,0x00},       //0x0C
    {0x00,0x00,0x3F,0x33,0x3F,0x30,0x30,0x30,0x30,0x70,0xF0,0xE0,0x00,0x00,0x00,0x00},       //0x0D
    {0x00,0x00,0x7F,0x63,0x7F,0x63,0x63,0x63,0x63,0x67,0xE7,0xE6,0xC0,0x00,0x00,0x00},       //0x0E
    {0x00,0x00,0x00,0x18,0x18,0xDB,0x3C,0xE7,0x3C,0xDB,0x18,0x18,0x00,0x00,0x00,0x00},       //0x0F
    {0x00,0x80,0xC0,0xE0,0xF0,0xF8,0xFE,0xF8,0xF0,0xE0,0xC0,0x80,0x00,0x00,0x00,0x00},       //0x10
    {0x00,0x02,0x06,0x0E,0x1E,0x3E,0xFE,0x3E,0x1E,0x0E,0x06,0x02,0x00,0x00,0x00,0x00},       //0x11
    {0x00,0x00,0x18,0x3C,0x7E,0x18,0x18,0x18,0x7E,0x3C,0x18,0x00,0x00,0x00,0x00,0x00},       //0x12
    {0x00,0x00,0x66,0x66,0x66,0x66,0x66,0x66,0x66,0x00,0x66,0x66,0x00,0x00,0x00,0x00},       //0x13
    {0x00,0x00,0x7F,0xDB,0xDB,0xDB,0x7B,0x1B,0x1B,0x1B,0x1B,0x1B,0x00,0x00,0x00,0x00},       //0x14
    {0x00,0x7C,0xC6,0x60,0x38,0x6C,0xC6,0xC6,0x6C,0x38,0x0C,0xC6,0x7C,0x00,0x00,0x00},       //0x15
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFE,0xFE,0xFE,0xFE,0x00,0x00,0x00,0x00},       //0x16
    {0x00,0x00,0x18,0x3C,0x7E,0x18,0x18,0x18,0x7E,0x3C,0x18,0x7E,0x00,0x00,0x00,0x00},       //0x17
    {0x00,0x00,0x18,0x3C,0x7E,0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x00,0x00,0x00,0x00},       //0x18
    {0x00,0x00,0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x7E,0x3C,0x18,0x00,0x00,0x00,0x00},       //0x19
    {0x00,0x00,0x00,0x00,0x00,0x18,0x0C,0xFE,0x0C,0x18,0x00,0x00,0x00,0x00,0x00,0x00},       //0x1A
    {0x00,0x00,0x00,0x00,0x00,0x30,0x60,0xFE,0x60,0x30,0x00,0x00,0x00,0x00,0x00,0x00},       //0x1B
    {0x00,0x00,0x00,0x00,0x00,0x00,0xC0,0xC0,0xC0,0xFE,0x00,0x00,0x00,0x00,0x00,0x00},       //0x1C
    {0x00,0x00,0x00,0x00,0x00,0x28,0x6C,0xFE,0x6C,0x28,0x00,0x00,0x00,0x00,0x00,0x00},       //0x1D
    {0x00,0x00,0x00,0x00,0x10,0x38,0x38,0x7C,0x7C,0xFE,0xFE,0x00,0x00,0x00,0x00,0x00},       //0x1E
    {0x00,0x00,0x00,0x00,0xFE,0xFE,0x7C,0x7C,0x38,0x38,0x10,0x00,0x00,0x00,0x00,0x00},       //0x1F
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x20' '
    {0x00,0x00,0x18,0x3C,0x3C,0x3C,0x18,0x18,0x18,0x00,0x18,0x18,0x00,0x00,0x00,0x00},       //0x21'!'
    {0x00,0x66,0x66,0x66,0x24,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x22'"'
    {0x00,0x00,0x00,0x6C,0x6C,0xFE,0x6C,0x6C,0x6C,0xFE,0x6C,0x6C,0x00,0x00,0x00,0x00},       //0x23'#'
    {0x18,0x18,0x7C,0xC6,0xC2,0xC0,0x7C,0x06,0x06,0x86,0xC6,0x7C,0x18,0x18,0x00,0x00},       //0x24'$'
    {0x00,0x00,0x00,0x00,0xC2,0xC6,0x0C,0x18,0x30,0x60,0xC6,0x86,0x00,0x00,0x00,0x00},       //0x25'%'
    {0x00,0x00,0x38,0x6C,0x6C,0x38,0x76,0xDC,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       //0x26'&'
    {0x00,0x30,0x30,0x30,0x60,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x27'''
    {0x00,0x00,0x0C,0x18,0x30,0x30,0x30,0x30,0x30,0x30,0x18,0x0C,0x00,0x00,0x00,0x00},       //0x28'('
    {0x00,0x00,0x30,0x18,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x18,0x30,0x00,0x00,0x00,0x00},       //0x29')'
    {0x00,0x00,0x00,0x00,0x00,0x66,0x3C,0xFF,0x3C,0x66,0x00,0x00,0x00,0x00,0x00,0x00},       //0x2A'*'
    {0x00,0x00,0x00,0x00,0x00,0x18,0x18,0x7E,0x18,0x18,0x00,0x00,0x00,0x00,0x00,0x00},       //0x2B'+'
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x18,0x18,0x30,0x00,0x00,0x00},       //0x2C','
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFE,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x2D'-'
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x18,0x00,0x00,0x00,0x00},       //0x2E'.'
    {0x00,0x00,0x00,0x00,0x02,0x06,0x0C,0x18,0x30,0x60,0xC0,0x80,0x00,0x00,0x00,0x00},       //0x2F'/'
    {0x00,0x00,0x38,0x6C,0xC6,0xC6,0xD6,0xD6,0xC6,0xC6,0x6C,0x38,0x00,0x00,0x00,0x00},       //0x30'0'
    {0x00,0x00,0x18,0x38,0x78,0x18,0x18,0x18,0x18,0x18,0x18,0x7E,0x00,0x00,0x00,0x00},       //0x31'1'
    {0x00,0x00,0x7C,0xC6,0x06,0x0C,0x18,0x30,0x60,0xC0,0xC6,0xFE,0x00,0x00,0x00,0x00},       //0x32'2'
    {0x00,0x00,0x7C,0xC6,0x06,0x06,0x3C,0x06,0x06,0x06,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x33'3'
    {0x00,0x00,0x0C,0x1C,0x3C,0x6C,0xCC,0xFE,0x0C,0x0C,0x0C,0x1E,0x00,0x00,0x00,0x00},       //0x34'4'
    {0x00,0x00,0xFE,0xC0,0xC0,0xC0,0xFC,0x06,0x06,0x06,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x35'5'
    {0x00,0x00,0x38,0x60,0xC0,0xC0,0xFC,0xC6,0xC6,0xC6,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x36'6'
    {0x00,0x00,0xFE,0xC6,0x06,0x06,0x0C,0x18,0x30,0x30,0x30,0x30,0x00,0x00,0x00,0x00},       //0x37'7'
    {0x00,0x00,0x7C,0xC6,0xC6,0xC6,0x7C,0xC6,0xC6,0xC6,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x38'8'
    {0x00,0x00,0x7C,0xC6,0xC6,0xC6,0x7E,0x06,0x06,0x06,0x0C,0x78,0x00,0x00,0x00,0x00},       //0x39'9'
    {0x00,0x00,0x00,0x00,0x18,0x18,0x00,0x00,0x00,0x18,0x18,0x00,0x00,0x00,0x00,0x00},       //0x3A':'
    {0x00,0x00,0x00,0x00,0x18,0x18,0x00,0x00,0x00,0x18,0x18,0x30,0x00,0x00,0x00,0x00},       //0x3B';'
    {0x00,0x00,0x00,0x06,0x0C,0x18,0x30,0x60,0x30,0x18,0x0C,0x06,0x00,0x00,0x00,0x00},       //0x3C'<'
    {0x00,0x00,0x00,0x00,0x00,0x7E,0x00,0x00,0x7E,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x3D'='
    {0x00,0x00,0x00,0x60,0x30,0x18,0x0C,0x06,0x0C,0x18,0x30,0x60,0x00,0x00,0x00,0x00},       //0x3E'>'
    {0x00,0x00,0x7C,0xC6,0xC6,0x0C,0x18,0x18,0x18,0x00,0x18,0x18,0x00,0x00,0x00,0x00},       //0x3F'?'
    {0x00,0x00,0x00,0x7C,0xC6,0xC6,0xDE,0xDE,0xDE,0xDC,0xC0,0x7C,0x00,0x00,0x00,0x00},       //0x40'@'
    {0x00,0x00,0x10,0x38,0x6C,0xC6,0xC6,0xFE,0xC6,0xC6,0xC6,0xC6,0x00,0x00,0x00,0x00},       //0x41'A'
    {0x00,0x00,0xFC,0x66,0x66,0x66,0x7C,0x66,0x66,0x66,0x66,0xFC,0x00,0x00,0x00,0x00},       //0x42'B'
    {0x00,0x00,0x3C,0x66,0xC2,0xC0,0xC0,0xC0,0xC0,0xC2,0x66,0x3C,0x00,0x00,0x00,0x00},       //0x43'C'
    {0x00,0x00,0xF8,0x6C,0x66,0x66,0x66,0x66,0x66,0x66,0x6C,0xF8,0x00,0x00,0x00,0x00},       //0x44'D'
    {0x00,0x00,0xFE,0x66,0x62,0x68,0x78,0x68,0x60,0x62,0x66,0xFE,0x00,0x00,0x00,0x00},       //0x45'E'
    {0x00,0x00,0xFE,0x66,0x62,0x68,0x78,0x68,0x60,0x60,0x60,0xF0,0x00,0x00,0x00,0x00},       //0x46'F'
    {0x00,0x00,0x3C,0x66,0xC2,0xC0,0xC0,0xDE,0xC6,0xC6,0x66,0x3A,0x00,0x00,0x00,0x00},       //0x47'G'
    {0x00,0x00,0xC6,0xC6,0xC6,0xC6,0xFE,0xC6,0xC6,0xC6,0xC6,0xC6,0x00,0x00,0x00,0x00},       //0x48'H'
    {0x00,0x00,0x3C,0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x49'I'
    {0x00,0x00,0x1E,0x0C,0x0C,0x0C,0x0C,0x0C,0xCC,0xCC,0xCC,0x78,0x00,0x00,0x00,0x00},       //0x4A'J'
    {0x00,0x00,0xE6,0x66,0x66,0x6C,0x78,0x78,0x6C,0x66,0x66,0xE6,0x00,0x00,0x00,0x00},       //0x4B'K'
    {0x00,0x00,0xF0,0x60,0x60,0x60,0x60,0x60,0x60,0x62,0x66,0xFE,0x00,0x00,0x00,0x00},       //0x4C'L'
    {0x00,0x00,0xC6,0xEE,0xFE,0xFE,0xD6,0xC6,0xC6,0xC6,0xC6,0xC6,0x00,0x00,0x00,0x00},       //0x4D'M'
    {0x00,0x00,0xC6,0xE6,0xF6,0xFE,0xDE,0xCE,0xC6,0xC6,0xC6,0xC6,0x00,0x00,0x00,0x00},       //0x4E'N'
    {0x00,0x00,0x7C,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x4F'O'
    {0x00,0x00,0xFC,0x66,0x66,0x66,0x7C,0x60,0x60,0x60,0x60,0xF0,0x00,0x00,0x00,0x00},       //0x50'P'
    {0x00,0x00,0x7C,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xD6,0xDE,0x7C,0x0C,0x0E,0x00,0x00},       //0x51'Q'
    {0x00,0x00,0xFC,0x66,0x66,0x66,0x7C,0x6C,0x66,0x66,0x66,0xE6,0x00,0x00,0x00,0x00},       //0x52'R'
    {0x00,0x00,0x7C,0xC6,0xC6,0x60,0x38,0x0C,0x06,0xC6,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x53'S'
    {0x00,0x00,0x7E,0x7E,0x5A,0x18,0x18,0x18,0x18,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x54'T'
    {0x00,0x00,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x55'U'
    {0x00,0x00,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0x6C,0x38,0x10,0x00,0x00,0x00,0x00},       //0x56'V'
    {0x00,0x00,0xC6,0xC6,0xC6,0xC6,0xD6,0xD6,0xD6,0xFE,0xEE,0x6C,0x00,0x00,0x00,0x00},       //0x57'W'
    {0x00,0x00,0xC6,0xC6,0x6C,0x7C,0x38,0x38,0x7C,0x6C,0xC6,0xC6,0x00,0x00,0x00,0x00},       //0x58'X'
    {0x00,0x00,0x66,0x66,0x66,0x66,0x3C,0x18,0x18,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x59'Y'
    {0x00,0x00,0xFE,0xC6,0x86,0x0C,0x18,0x30,0x60,0xC2,0xC6,0xFE,0x00,0x00,0x00,0x00},       //0x5A'Z'
    {0x00,0x00,0x3C,0x30,0x30,0x30,0x30,0x30,0x30,0x30,0x30,0x3C,0x00,0x00,0x00,0x00},       //0x5B'['
    {0x00,0x00,0x00,0x80,0xC0,0xE0,0x70,0x38,0x1C,0x0E,0x06,0x02,0x00,0x00,0x00,0x00},       //0x5C'\'
    {0x00,0x00,0x3C,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x0C,0x3C,0x00,0x00,0x00,0x00},       //0x5D']'
    {0x10,0x38,0x6C,0xC6,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x5E'^'
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0x00,0x00},       //0x5F'_'
    {0x30,0x30,0x18,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x60'`'
    {0x00,0x00,0x00,0x00,0x00,0x78,0x0C,0x7C,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       //0x61'a'
    {0x00,0x00,0xE0,0x60,0x60,0x78,0x6C,0x66,0x66,0x66,0x66,0x7C,0x00,0x00,0x00,0x00},       //0x62'b'
    {0x00,0x00,0x00,0x00,0x00,0x7C,0xC6,0xC0,0xC0,0xC0,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x63'c'
    {0x00,0x00,0x1C,0x0C,0x0C,0x3C,0x6C,0xCC,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       //0x64'd'
    {0x00,0x00,0x00,0x00,0x00,0x7C,0xC6,0xFE,0xC0,0xC0,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x65'e'
    {0x00,0x00,0x38,0x6C,0x64,0x60,0xF0,0x60,0x60,0x60,0x60,0xF0,0x00,0x00,0x00,0x00},       //0x66'f'
    {0x00,0x00,0x00,0x00,0x00,0x76,0xCC,0xCC,0xCC,0xCC,0xCC,0x7C,0x0C,0xCC,0x78,0x00},       //0x67'g'
    {0x00,0x00,0xE0,0x60,0x60,0x6C,0x76,0x66,0x66,0x66,0x66,0xE6,0x00,0x00,0x00,0x00},       //0x68'h'
    {0x00,0x00,0x18,0x18,0x00,0x38,0x18,0x18,0x18,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x69'i'
    {0x00,0x00,0x06,0x06,0x00,0x0E,0x06,0x06,0x06,0x06,0x06,0x06,0x66,0x66,0x3C,0x00},       //0x6A'j'
    {0x00,0x00,0xE0,0x60,0x60,0x66,0x6C,0x78,0x78,0x6C,0x66,0xE6,0x00,0x00,0x00,0x00},       //0x6B'k'
    {0x00,0x00,0x38,0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x3C,0x00,0x00,0x00,0x00},       //0x6C'l'
    {0x00,0x00,0x00,0x00,0x00,0xEC,0xFE,0xD6,0xD6,0xD6,0xD6,0xC6,0x00,0x00,0x00,0x00},       //0x6D'm'
    {0x00,0x00,0x00,0x00,0x00,0xDC,0x66,0x66,0x66,0x66,0x66,0x66,0x00,0x00,0x00,0x00},       //0x6E'n'
    {0x00,0x00,0x00,0x00,0x00,0x7C,0xC6,0xC6,0xC6,0xC6,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x6F'o'
    {0x00,0x00,0x00,0x00,0x00,0xDC,0x66,0x66,0x66,0x66,0x66,0x7C,0x60,0x60,0xF0,0x00},       //0x70'p'
    {0x00,0x00,0x00,0x00,0x00,0x76,0xCC,0xCC,0xCC,0xCC,0xCC,0x7C,0x0C,0x0C,0x1E,0x00},       //0x71'q'
    {0x00,0x00,0x00,0x00,0x00,0xDC,0x76,0x66,0x60,0x60,0x60,0xF0,0x00,0x00,0x00,0x00},       //0x72'r'
    {0x00,0x00,0x00,0x00,0x00,0x7C,0xC6,0x60,0x38,0x0C,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x73's'
    {0x00,0x00,0x10,0x30,0x30,0xFC,0x30,0x30,0x30,0x30,0x36,0x1C,0x00,0x00,0x00,0x00},       //0x74't'
    {0x00,0x00,0x00,0x00,0x00,0xCC,0xCC,0xCC,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       //0x75'u'
    {0x00,0x00,0x00,0x00,0x00,0x66,0x66,0x66,0x66,0x66,0x3C,0x18,0x00,0x00,0x00,0x00},       //0x76'v'
    {0x00,0x00,0x00,0x00,0x00,0xC6,0xC6,0xD6,0xD6,0xD6,0xFE,0x6C,0x00,0x00,0x00,0x00},       //0x77'w'
    {0x00,0x00,0x00,0x00,0x00,0xC6,0x6C,0x38,0x38,0x38,0x6C,0xC6,0x00,0x00,0x00,0x00},       //0x78'x'
    {0x00,0x00,0x00,0x00,0x00,0xC6,0xC6,0xC6,0xC6,0xC6,0xC6,0x7E,0x06,0x0C,0xF8,0x00},       //0x79'y'
    {0x00,0x00,0x00,0x00,0x00,0xFE,0xCC,0x18,0x30,0x60,0xC6,0xFE,0x00,0x00,0x00,0x00},       //0x7A'z'
    {0x00,0x00,0x0E,0x18,0x18,0x18,0x70,0x18,0x18,0x18,0x18,0x0E,0x00,0x00,0x00,0x00},       //0x7B'{'
    {0x00,0x00,0x18,0x18,0x18,0x18,0x00,0x18,0x18,0x18,0x18,0x18,0x00,0x00,0x00,0x00},       //0x7C'|'
    {0x00,0x00,0x70,0x18,0x18,0x18,0x0E,0x18,0x18,0x18,0x18,0x70,0x00,0x00,0x00,0x00},       //0x7D'}'
    {0x00,0x00,0x76,0xDC,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},       //0x7E'~'
    {0x00,0x00,0x00,0x00,0x10,0x38,0x6C,0xC6,0xC6,0xC6,0xFE,0x00,0x00,0x00,0x00,0x00},       //0x7F''
    {0x00,0x00,0x3C,0x66,0xC2,0xC0,0xC0,0xC0,0xC2,0x66,0x3C,0x0C,0x06,0x7C,0x00,0x00},       //0x80
    {0x00,0x00,0xCC,0x00,0x00,0xCC,0xCC,0xCC,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       //0x81
    {0x00,0x0C,0x18,0x30,0x00,0x7C,0xC6,0xFE,0xC0,0xC0,0xC6,0x7C,0x00,0x00,0x00,0x00},       //0x82
    {0x00,0x10,0x38,0x6C,0x00,0x78,0x0C,0x7C,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       //0x83
    {0x00,0x00,0xCC,0x00,0x00,0x78,0x0C,0x7C,0xCC,0xCC,0xCC,0x76,0x00,0x00,0x00,0x00},       
};

/* chinese char */
const UINT8 sChinese[][32] =
{   
    {0x04,0x80,0x0E,0xA0,0x78,0x90,0x08,0x90,0x08,0x84,0xFF,0xFE,0x08,0x80,0x08,0x90,
	 0x0A,0x90,0x0C,0x60,0x18,0x40,0x68,0xA0,0x09,0x20,0x0A,0x14,0x28,0x14,0x10,0x0C},
    {0x00,0x02,0xBC,0x20,0x20,0x20,0xBF,0x24,0x24,0xA4,0x24,0x24,0xA4,0x44,0x44,0x84,
     0x08,0x04,0x3F,0x00,0x11,0x0A,0x7F,0x04,0x04,0x3F,0x04,0x15,0x24,0x44,0x14,0x08},
    {0x20,0x20,0xFC,0x24,0xFF,0x24,0xFC,0x20,0xFC,0x20,0x20,0xFE,0x20,0x20,0xFF,0x00,
     0x00,0x00,0x7D,0x04,0x0B,0x08,0x11,0x3C,0x05,0x04,0x24,0x1B,0x08,0x16,0x21,0x40},
    {0x00,0x80,0x80,0xFF,0x08,0x08,0x10,0x10,0x20,0x40,0x80,0x40,0x20,0x10,0x0C,0x03,
     0x01,0x00,0x00,0x7F,0x08,0x08,0x04,0x04,0x02,0x01,0x00,0x01,0x02,0x04,0x18,0x60},
    {0x10,0x10,0x90,0x90,0xFE,0x10,0x10,0x10,0x10,0xFF,0x10,0x10,0x10,0x10,0x10,0x10,
     0x04,0x04,0x04,0x08,0x08,0x19,0x19,0x2A,0x48,0x0B,0x08,0x08,0x08,0x08,0x08,0x08}, 
    {0x01,0x41,0x21,0x37,0x21,0x01,0x01,0xF7,0x11,0x11,0x12,0x12,0x14,0x28,0x47,0x00,
     0x10,0x10,0x10,0xFC,0x10,0x10,0x10,0xFE,0x10,0x10,0x10,0x10,0x10,0x00,0xFE,0x00},
    {0x10,0x08,0x08,0x08,0xC8,0x38,0x08,0x00,0x20,0x38,0x26,0x21,0x20,0x20,0x18,0x00,
	 0x00,0x00,0x00,0xFE,0x02,0x02,0x02,0x00,0x00,0x00,0x00,0x7F,0x40,0x40,0x40,0x00},
};


// 小端模式
// byte转int  
UINT64 BytesToInt8(UINT8 *bytes)
{
    UINT64 s = bytes[0];
    s += ((UINT64)bytes[1]) << 8;
    s += ((UINT64)bytes[2]) << 16;
    s += ((UINT64)bytes[3]) << 24;
    s += ((UINT64)bytes[4]) << 32;
    s += ((UINT64)bytes[5]) << 40;
    s += ((UINT64)bytes[6]) << 48;
    s += ((UINT64)bytes[7]) << 56;
    //printf("%llu\n",  s );

    return s;
}

UINT32 BytesToInt4(UINT8 *bytes)
{
    UINT32 Result = bytes[0] & 0xFF;
    Result |= (bytes[1] << 8 & 0xFF00);
    Result |= ((bytes[2] << 16) & 0xFF0000);
    Result |= ((bytes[3] << 24) & 0xFF000000);
    return Result;
}

UINT16 BytesToInt2(UINT8 *bytes)
{
    UINT16 Result = bytes[0] & 0xFF;
    Result |= (bytes[1] << 8 & 0xFF00);
    return Result;
}


void CopyColorIntoBuffer(UINT8 *pBuffer, EFI_GRAPHICS_OUTPUT_BLT_PIXEL color, UINT16 x0, UINT16 y0, UINT16 AreaWidth)
{
    pBuffer[y0 * AreaWidth * 4 + x0 * 4]     = color.Blue;
    pBuffer[y0 * AreaWidth * 4 + x0 * 4 + 1] = color.Green;
    pBuffer[y0 * AreaWidth * 4 + x0 * 4 + 2] = color.Red;
    pBuffer[y0 * AreaWidth * 4 + x0 * 4 + 3] = color.Reserved;

}

void CopyColorIntoBuffer2(UINT8 *pBuffer, EFI_GRAPHICS_OUTPUT_BLT_PIXEL color, UINT16 x0, UINT16 y0)
{
    pBuffer[y0 * 8 * 4 + x0 * 4]     = color.Blue;
    pBuffer[y0 * 8 * 4 + x0 * 4 + 1] = color.Green;
    pBuffer[y0 * 8 * 4 + x0 * 4 + 2] = color.Red;
    pBuffer[y0 * 8 * 4 + x0 * 4 + 3] = color.Reserved;
}

void CopyColorIntoBuffer3(UINT8 *pBuffer, EFI_GRAPHICS_OUTPUT_BLT_PIXEL color, UINT16 x0, UINT16 y0, UINT8 AreaWidth)
{
    pBuffer[y0 * AreaWidth * 4 + x0 * 4]     = color.Blue;
    pBuffer[y0 * AreaWidth * 4 + x0 * 4 + 1] = color.Green;
    pBuffer[y0 * AreaWidth * 4 + x0 * 4 + 2] = color.Red;
    pBuffer[y0 * AreaWidth * 4 + x0 * 4 + 3] = color.Reserved;
}

INT32 Math_ABS(INT32 v)
{
	return (v < 0) ? -v : v;
}

EFI_STATUS LineDrawIntoBuffer(UINT8 *pBuffer,
        IN UINTN x0, UINTN y0, UINTN x1, UINTN y1, 
        IN UINTN BorderWidth,
        IN EFI_GRAPHICS_OUTPUT_BLT_PIXEL BorderColor, UINT16 AreaWidth)
{

    INT32 dx  = Math_ABS((int)(x1 - x0));
    INT32 sx  = x0 < x1 ? 1 : -1;
    INT32 dy  = Math_ABS((int)(y1-y0)), sy = y0 < y1 ? 1 : -1;
    INT32 err = ( dx > dy ? dx : -dy) / 2, e2;
    
    for(;;)
    {    
        CopyColorIntoBuffer(pBuffer, BorderColor, x0, y0, AreaWidth);
        
        if (x0==x1 && y0==y1) break;
    
        e2 = err;
    
        if (e2 > -dx) { err -= dy; x0 += sx; }
        if (e2 <  dy) { err += dx; y0 += sy; }
    }
    return EFI_SUCCESS;
}



// draw rectangle borders
void RectangleDrawIntoBuffer(UINT8 *pBuffer,
        IN UINTN x0, UINTN y0, UINTN x1, UINTN y1, 
        IN UINTN BorderWidth,
        IN EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color, UINT16 AreaWidth)
{    
    if (NULL == pBuffer)
	{
		DEBUG ((EFI_D_INFO, "NULL == pBuffer"));
		return ;
	}
	
    LineDrawIntoBuffer(pBuffer, x0, y0, x0, y1, 1, Color, AreaWidth);
    LineDrawIntoBuffer(pBuffer, x0, y0, x1, y0, 1, Color, AreaWidth);
    LineDrawIntoBuffer(pBuffer, x0, y1, x1, y1, 1, Color, AreaWidth);
    LineDrawIntoBuffer(pBuffer, x1, y0, x1, y1, 1, Color, AreaWidth);

}


VOID GraphicsCopy(UINT8 *pDest, UINT8 *pSource, 
						   UINT16 DestWidth, UINT16 DestHeight, 
						   UINT16 SourceWidth, UINT16 SourceHeight, 
					       UINT16 StartX, UINT16 StartY)
{
	int i, j;
	for(i = 0; i < SourceHeight; i++)
	{
		for (j = 0; j < SourceWidth; j++)
		{
			pDest[((StartY + i) * DestWidth + StartX + j) * 4] = pSource[(i * SourceWidth + j) * 4];
			pDest[((StartY + i) * DestWidth + StartX + j) * 4 + 1] = pSource[(i * SourceWidth + j) * 4 + 1];
			pDest[((StartY + i) * DestWidth + StartX + j) * 4 + 2] = pSource[(i * SourceWidth + j) * 4 + 2];
			pDest[((StartY + i) * DestWidth + StartX + j) * 4 + 3] = pSource[(i * SourceWidth + j) * 4 + 3];
		}
	}
}

// Draw 8 X 16 point
EFI_STATUS Draw8_16IntoBuffer(UINT8 *pBuffer,UINT8 d,
        IN UINTN x0, UINTN y0,
        UINT8 width,
        IN EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color, UINT16 AreaWidth)
{
    //DebugPrint1(10, 10, "%X %X %X %X", x0, y0, AreaWidth);
    if (NULL == pBuffer)
    {
    	DEBUG ((EFI_D_INFO, "pBuffer is NULL\n"));
    	return EFI_SUCCESS;
    }
        
    if ((d & 0x80) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 0, y0, AreaWidth ); 
    
    if ((d & 0x40) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 1, y0, AreaWidth );
    
    if ((d & 0x20) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 2, y0, AreaWidth );
    
    if ((d & 0x10) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 3, y0, AreaWidth );
    
    if ((d & 0x08) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 4, y0, AreaWidth );
    
    if ((d & 0x04) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 5, y0, AreaWidth );
    
    if ((d & 0x02) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 6, y0, AreaWidth );
    
    if ((d & 0x01) != 0) 
        CopyColorIntoBuffer(pBuffer, Color, x0 + 7, y0, AreaWidth );



    return EFI_SUCCESS;
}

EFI_STATUS DrawAsciiCharUseBuffer(UINT8 *pBufferDest,
        IN UINTN x0, UINTN y0, UINT8 c,
        IN EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color)
{
    INT16 i;
    UINT8 d;
    UINT8 pBuffer[16 * 8 * 4];

	if ('\0' == c)
		return;

    for(i = 0; i < 16 * 8 * 4; i++)
	{
	    pBuffer[i] = 0x00;
	}
    
	for(i = 0; i < 16; i++)
	{
		d = sASCII[c][i];
		
		if ((d & 0x80) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 0, i); 
		
		if ((d & 0x40) != 0) 
            CopyColorIntoBuffer2(pBuffer, Color, 1, i);
		
		if ((d & 0x20) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 2, i);
		
		if ((d & 0x10) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 3, i);
		
		if ((d & 0x08) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 4, i);
		
		if ((d & 0x04) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 5, i);
		
		if ((d & 0x02) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 6, i);
		
		if ((d & 0x01) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 7, i);
		
	}

	GraphicsCopy(pBufferDest, pBuffer, ScreenWidth, ScreenHeight, 8, 16, x0, y0);
	
	/*
    GraphicsOutput->Blt(GraphicsOutput, 
                        (EFI_GRAPHICS_OUTPUT_BLT_PIXEL *) pBuffer,
                        EfiBltBufferToVideo,
                        0, 0, 
                        x0, y0, 
                        8, 16, 
                        0);   
      */          
    return EFI_SUCCESS;
}


EFI_STATUS DrawChineseCharIntoBuffer2(UINT8 *pBuffer,
        IN UINTN x0, UINTN y0, UINT32 offset,
        IN EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color , UINT16 AreaWidth)
{
    INT8 i;
    //DebugPrint1(10, 10, "%X %X %X %X", x0, y0, offset, AreaWidth);
    //DEBUG ((EFI_D_INFO, "%X %X %X %X", x0, y0, offset, AreaWidth));

	if (NULL == pBuffer)
	{
		DEBUG ((EFI_D_INFO, "NULL == pBuffer"));
		return EFI_SUCCESS;
	}

	if (offset < 1)
	{
		DEBUG ((EFI_D_INFO, "offset < 1 \n"));
		return EFI_SUCCESS;
	}
    
	for(i = 0; i < 32; i += 2)
	{
        Draw8_16IntoBuffer(pBuffer, sChineseChar[offset * 32 + i ],     x0,     y0 + i / 2, 1, Color, AreaWidth);		        
		 Draw8_16IntoBuffer(pBuffer, sChineseChar[offset * 32 + i + 1],  x0 + 8, y0 + i / 2, 1, Color, AreaWidth);		
	}
	
    //DEBUG ((EFI_D_INFO, "\n"));
	
    return EFI_SUCCESS;
}


VOID StringMaker (UINT16 x, UINT16 y,
  IN  CONST CHAR8   *Format,
  IN  VA_LIST       VaList
  )
{
    EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color;
	UINT32 i = 0;
	
	for (i = 0; i < 0x100; i++)
		AsciiBuffer[i] = 0;
		
	Color.Blue = 0xFF;
	Color.Red = 0xFF;
	Color.Green = 0xFF;

    ASSERT (Format != NULL);

	// Note this api do not supported ("%f", float)
    AsciiVSPrint (AsciiBuffer, sizeof (AsciiBuffer), Format, VaList);
	/*
	if (StatusErrorCount % 61 == 0)
	{
		for (int j = 0; j < ScreenHeight - 25; j++)
		{
			for (int i = ScreenWidth / 2; i < ScreenWidth; i++)
			{
				pDeskBuffer[(j * ScreenWidth + i) * 4]     = 0x84;
				pDeskBuffer[(j * ScreenWidth + i) * 4 + 1] = 0x84;
				pDeskBuffer[(j * ScreenWidth + i) * 4 + 2] = 0x00;
			}
		}		
	}
	
	
	if (DisplayCount % 52 == 0)
	{
		for (int j = 2; j < 54 * 16; j++)
		{
			for (int i = 0; i < ScreenWidth / 4; i++)
			{
				pDeskBuffer[(j * ScreenWidth + i) * 4]     = 0x84;
				pDeskBuffer[(j * ScreenWidth + i) * 4 + 1] = 0x84;
				pDeskBuffer[(j * ScreenWidth + i) * 4 + 2] = 0x00;
			}
		}		
	}
	*/
    for (i = 0; i < sizeof(AsciiBuffer) /sizeof(CHAR8); i++)
        DrawAsciiCharUseBuffer(pDeskBuffer, x + i * 8, y, AsciiBuffer[i], Color);

}


EFI_STATUS DrawAsciiCharUseBuffer2(UINT8 *pBufferDest,
        IN UINTN x0, UINTN y0, UINT8 c,
        IN EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color)
{
    INT16 i;
    UINT8 d;
    UINT8 pBuffer[16 * 8 * 4];

	if ('\0' == c)
		return;

    for(i = 0; i < 16 * 8 * 4; i++)
	{
	    pBuffer[i] = 0x00;
	}
    
	for(i = 0; i < 16; i++)
	{
		d = sASCII[c][i];
		
		if ((d & 0x80) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 0, i); 
		
		if ((d & 0x40) != 0) 
            CopyColorIntoBuffer2(pBuffer, Color, 1, i);
		
		if ((d & 0x20) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 2, i);
		
		if ((d & 0x10) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 3, i);
		
		if ((d & 0x08) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 4, i);
		
		if ((d & 0x04) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 5, i);
		
		if ((d & 0x02) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 6, i);
		
		if ((d & 0x01) != 0) 
		    CopyColorIntoBuffer2(pBuffer, Color, 7, i);
		
	}

	GraphicsCopy(pBufferDest, pBuffer, MyComputerWidth, ScreenHeight, 8, 16, x0, y0);
	
	/*
    GraphicsOutput->Blt(GraphicsOutput, 
                        (EFI_GRAPHICS_OUTPUT_BLT_PIXEL *) pBuffer,
                        EfiBltBufferToVideo,
                        0, 0, 
                        x0, y0, 
                        8, 16, 
                        0);   
      */          
    return EFI_SUCCESS;
}



VOID StringMaker2 (UINT16 x, UINT16 y, UINT8 *pBuffer,
  IN  CONST CHAR8   *Format,
  IN  VA_LIST       VaList
  )
{
    EFI_GRAPHICS_OUTPUT_BLT_PIXEL Color;
	UINT32 i = 0;
	
	for (i = 0; i < 0x100; i++)
		AsciiBuffer[i] = 0;
		
	Color.Blue = 0xFF;
	Color.Red = 0xFF;
	Color.Green = 0xFF;
	Color.Reserved = GRAPHICS_LAYER_MY_COMPUTER;

    ASSERT (Format != NULL);

    AsciiVSPrint (AsciiBuffer, sizeof (AsciiBuffer), Format, VaList);
			
    for (i = 0; i < sizeof(AsciiBuffer) /sizeof(CHAR8); i++)
        DrawAsciiCharUseBuffer2(pBuffer, x + i * 8, y, AsciiBuffer[i], Color);

}


/* Display a string */
VOID EFIAPI DebugPrint1 (UINT16 x, UINT16 y,  IN  CONST CHAR8  *Format, ...)
{
	if (y > ScreenHeight - 16 || x > ScreenWidth - 8)
		return;

	VA_LIST         VaList;
	VA_START (VaList, Format);
	StringMaker(x, y, Format, VaList);
	VA_END (VaList);
}

/* Display a string */
VOID EFIAPI DebugPrint2 (UINT16 x, UINT16 y, UINT8 *pBuffer, IN  CONST CHAR8  *Format, ...)
{
	if (y > MyComputerHeight - 16 || x > MyComputerWidth - 8)
		return;

	VA_LIST         VaList;
	VA_START (VaList, Format);
	StringMaker2(x, y, pBuffer, Format, VaList);
	VA_END (VaList);
}


EFI_STATUS StrCmpSelf(UINT8 *p1, UINT8 *p2, UINT16 length)
{
	DebugPrint1(DISPLAY_ERROR_STATUS_X, DISPLAY_ERROR_STATUS_Y, "%d: \n", __LINE__);
	
	for (int i = 0; i < length; i++)
	{
		DebugPrint1(DISPLAY_ERROR_STATUS_X, DISPLAY_ERROR_STATUS_Y, "%02X %02X ", p1[i], p2[i]);
		if (p1[i] != p2[i])
			return -1;
	}
	return EFI_SUCCESS;
}


FAT32_ROOTPATH_SHORT_FILE_ITEM pItems[32];

EFI_STATUS RootPathAnalysis(UINT8 *p)
{
	/*pItems = (FAT32_ROOTPATH_SHORT_FILE_ITEM *)AllocateZeroPool(DISK_BUFFER_SIZE);
	if (NULL == pItems)
	{
		DebugPrint1(DISPLAY_ERROR_STATUS_X, DISPLAY_ERROR_STATUS_Y, "%d: \n", __LINE__);
		return EFI_SUCCESS;
	}
	*/
	memcpy(&pItems, p, DISK_BUFFER_SIZE);
	UINT16 valid_count = 0;

	//display filing file and subpath. 
	for (int i = 0; i < 30; i++)
		if (pItems[i].FileName[0] != 0xE5 && (pItems[i].Attribute[0] == 0x20 
		    || pItems[i].Attribute[0] == 0x10))
       {
        	DebugPrint1(DISK_MBR_X, 16 * 36 + (valid_count) * 16, "FileName:%2c%2c%2c%2c%2c%2c%2c%2c ExtensionName:%2c%2c%2c StartCluster:%02X%02X%02X%02X FileLength: %02X%02X%02X%02X Attribute: %02X    ", 
                                            pItems[i].FileName[0], pItems[i].FileName[1], pItems[i].FileName[2], pItems[i].FileName[3], pItems[i].FileName[4], pItems[i].FileName[5], pItems[i].FileName[6], pItems[i].FileName[7],
                                            pItems[i].ExtensionName[0], pItems[i].ExtensionName[1],pItems[i].ExtensionName[2],
                                            pItems[i].StartClusterHigh2B[0], pItems[i].StartClusterHigh2B[1],
                                            pItems[i].StartClusterLow2B[0], pItems[i].StartClusterLow2B[1],
                                            pItems[i].FileLength[0], pItems[i].FileLength[1], pItems[i].FileLength[2], pItems[i].FileLength[3],
                                            pItems[i].Attribute[0]);
			
			valid_count++;

			//for (int j = 0; j < 5; j++)
			//	DebugPrint1(j * 3 * 8, 16 * 40 + valid_count * 16, "%02X ", pItems[i].FileName[j]);
			if (StrCmpSelf(pItems[i].FileName, "HZK16", 5) == EFI_SUCCESS)			
			{
	        	/*DebugPrint1(DISK_MBR_X, 16 * 30 + (valid_count) * 16 + 4 * 16, "FileName:%2c%2c%2c%2c%2c%2c%2c%2c ExtensionName:%2c%2c%2c StartCluster:%02X%02X%02X%02X FileLength: %02X%02X%02X%02X Attribute: %02X    ", 
                                pItems[i].FileName[0], pItems[i].FileName[1], pItems[i].FileName[2], pItems[i].FileName[3], pItems[i].FileName[4], pItems[i].FileName[5], pItems[i].FileName[6], pItems[i].FileName[7],
                                pItems[i].ExtensionName[0], pItems[i].ExtensionName[1],pItems[i].ExtensionName[2],
                                pItems[i].StartClusterHigh2B[0], pItems[i].StartClusterHigh2B[1],
                                pItems[i].StartClusterLow2B[0], pItems[i].StartClusterLow2B[1],
                                pItems[i].FileLength[0], pItems[i].FileLength[1], pItems[i].FileLength[2], pItems[i].FileLength[3],
                                pItems[i].Attribute[0]);
				*/
              FileBlockStart = (UINT32)pItems[i].StartClusterHigh2B[0] * 16 * 16 * 16 * 16 + (UINT32)pItems[i].StartClusterHigh2B[1] * 16 * 16 * 16 * 16 * 16 * 16 + pItems[i].StartClusterLow2B[0] + (UINT32)pItems[i].StartClusterLow2B[1] * 16 * 16;
              FileLength = pItems[i].FileLength[0] + (UINT32)pItems[i].FileLength[1] * 16 * 16 + (UINT32)pItems[i].FileLength[2] * 16 * 16 * 16 * 16 + (UINT32)pItems[i].FileLength[3] * 16 * 16 * 16 * 16 * 16 * 16;

              DebugPrint1(DISPLAY_ERROR_STATUS_X, DISPLAY_ERROR_STATUS_Y, "%d: FileBlockStart: %d FileLength: %ld\n", __LINE__, FileBlockStart, FileLength);
			}
		}

}

EFI_STATUS RootPathAnalysis1(UINT8 *p)
{
	memcpy(&pItems, p, DISK_BUFFER_SIZE);
	UINT16 valid_count = 0;

	//display filing file and subpath. 
	for (int i = 0; i < 30; i++)
		if (pItems[i].FileName[0] != 0xE5 && (pItems[i].Attribute[0] == 0x20 
		    || pItems[i].Attribute[0] == 0x10))
       {
        	DebugPrint1(DISPLAY_ERROR_STATUS_X, DISPLAY_ERROR_STATUS_Y, "FileName:%2c%2c%2c%2c%2c%2c%2c%2c ExtensionName:%2c%2c%2c StartCluster:%02X%02X%02X%02X FileLength: %02X%02X%02X%02X Attribute: %02X    ", 
                                            pItems[i].FileName[0], pItems[i].FileName[1], pItems[i].FileName[2], pItems[i].FileName[3], pItems[i].FileName[4], pItems[i].FileName[5], pItems[i].FileName[6], pItems[i].FileName[7],
                                            pItems[i].ExtensionName[0], pItems[i].ExtensionName[1],pItems[i].ExtensionName[2],
                                            pItems[i].StartClusterHigh2B[0], pItems[i].StartClusterHigh2B[1],
                                            pItems[i].StartClusterLow2B[0], pItems[i].StartClusterLow2B[1],
                                            pItems[i].FileLength[0], pItems[i].FileLength[1], pItems[i].FileLength[2], pItems[i].FileLength[3],
                                            pItems[i].Attribute[0]);
			
			valid_count++;
		}
}


MasterBootRecordSwitched MBRSwitched;
DollarBootSwitched NTFSBootSwitched;

// 文件记录头
typedef struct
{
	/*+0x00*/ UINT8 Type[4];    // 固定值'FILE'
	/*+0x04*/ UINT8 USNOffset[2]; // 更新序列号偏移, 与操作系统有关
	/*+0x06*/ UINT8 USNCount[2]; // 固定列表大小Size in words of Update Sequence Number & Array (S)
	/*+0x08*/ UINT8 Lsn[8]; // 日志文件序列号(LSN)
	/*+0x10*/ UINT8 SequenceNumber[2]; // 序列号(用于记录文件被反复使用的次数)
	/*+0x12*/ UINT8 LinkCount[2];// 硬连接数
	/*+0x14*/ UINT8 AttributeOffset[2]; // 第一个属性偏移
	/*+0x16*/ UINT8 Flags[2];// flags, 00表示删除文件,01表示正常文件,02表示删除目录,03表示正常目录
	/*+0x18*/ UINT8 BytesInUse[4]; // 文件记录实时大小(字节) 当前MFT表项长度,到FFFFFF的长度+4
	/*+0x1C*/ UINT8 BytesAllocated[4]; // 文件记录分配大小(字节)
	/*+0x20*/ UINT8 BaseFileRecord[8]; // = 0 基础文件记录 File reference to the base FILE record
	/*+0x28*/ UINT8 NextAttributeNumber[2]; // 下一个自由ID号
	/*+0x2A*/ UINT8 Pading[2]; // 边界
	/*+0x2C*/ UINT8 MFTRecordNumber[4]; // windows xp中使用,本MFT记录号
	/*+0x30*/ UINT8 USN[2]; // 更新序列号
	/*+0x32*/ UINT8 UpdateArray[0]; // 更新数组
 } FILE_HEADER, *pFILE_HEADER; 

typedef struct  
{
	UINT8 Type[4];   //属性类型
	UINT8 Size[4];   //属性头和属性体的总长度
	UINT8 ResidentFlag; //是否是常驻属性（0常驻 1非常驻）
	UINT8 NameSize;   //属性名的长度
	UINT8 NameOffset[2]; //属性名的偏移 相对于属性头
	UINT8 Flags[2]; //标志（0x0001压缩 0x4000加密 0x8000稀疏）
	UINT8 Id[2]; //属性唯一ID
}CommonAttributeHeader;

int display_sector_number = 0;
typedef struct 
{
	UINT8 OccupyCluster;
	UINT64 Offset; //Please Note: The first item is start offset, and next item is relative offset....
}IndexInformation;

UINT16 BytesToInt3(UINT8 *bytes)
{
	//INFO("%x %x %x\n", bytes[0], bytes[1], bytes[2]);
	UINT16 Result = bytes[0] & 0xFF;
    Result |= (bytes[1] << 8 & 0xFF00);
    Result |= ((bytes[2] << 16) & 0xFF0000);
	return Result;
}

UINTN strlen1(char *String)
{
    UINTN  Length;
    for (Length = 0; *String != '\0'; String++, Length++) ;
//	 DEBUG ((EFI_D_INFO, "%d Length: %d\n", __LINE__, Length));
    return Length;
